//! @mainpage
//! <b>SCC</b><br>
//! <b> Version: @Version </b><br>
//! <b> Copyright: (C) Danila Baygushev (IDanila24@gmail.com) </b><br>
//! <br>
//! @warning <b>Для использования библиотеки требуется согласие автора.</b><br>
//!
//! <b>По вопросам и предложениям @StartCrossзахватить мир@EndCross просьба обращаться сюда: IDanila24@gmail.com.@StartCrossУ нас есть печеньки.@EndCross</b>
//! <br>
//! Мультитранслятор языков разого уровня SCC.
//! <br>
//! SCC - мультитранслятор с поддержкой экзотерических языков на c++. Возможно иполнеие программ на software-процессоре с возможностью JIT-компиляци.<br>
//! Документация на русском языке.<br>
//! <br>
//! Чтобы начать работу с библиотекой просто перейдите в раздел описания, и посмотрите примеры. <br>
